// Main program by Ruslan and Frouk
// complete bindings, arbitrary player count, analog support by Jacky720
#include "pch.h"
#include <assert.h>
#include "gui.h"
#include <Events.h>
#include "imgui/imgui.h"
#include "IniReader.h"
#include "spawner.cpp"
#include <Trigger.h>
#include <GameMenuStatus.h>
#include <Pl0000.h>
#include <EntitySystem.h>
#include <Entity.h>
#include <cCameraGame.h>
#include <cGameUIManager.h>
#include <injector/injector.hpp>
#include <string>
#include <iostream>
#include <sstream>
#include <fstream>
#include <cstdlib>
#include <PlayerManagerImplement.h>
#include <XInput.h>
#include <BehaviorEmBase.h>
#include <d3dx9.h>
#include <math.h>

#ifdef _MSC_VER < 1700 //pre 2012
#pragma comment(lib,"Xinput.lib")
#else
#pragma comment(lib,"Xinput9_1_0.lib")
#endif
#include <Windows.h>
#include <Camera.h>

bool configLoaded = false;
//bool SamSpawned = false;
//bool WolfSpawned = false;

bool AutoNormalAttackEnable = false;
bool AutoStrongAttackEnable = false;

/*
bool ArmstrongAtOnce = false;
bool SundownerAtOnce = false;
bool MistralAtOnce = false;
bool MonsoonAtOnce = false;
bool SamAtOnce = false;
*/



bool PlayAsMistral = false;
bool PlayAsMonsoon = false;
bool PlayAsSundowner = false;
bool PlayAsSam = false;
bool BossSamCanDamagePlayer = true;
bool PlayAsArmstrong = false;
bool ArmstrongCanDamagePlayer = true;


bool EnableDamageToPlayers = false;

//unsigned int sword = 0x0;
//unsigned int originalSword = 0x0;


bool isMenuShow = false;


//eObjID mObjId = (eObjID)0x0;

unsigned int HotKey = VK_INSERT; //Hotkey for menu show


std::string Forward = "26";
std::string Back = "28";
std::string Left = "25";
std::string Right = "27";
std::string NormalAttack = "49"; // I
std::string StrongAttack = "4F"; // O
std::string Jump = "50"; // P
std::string Interact = "74";
std::string CamUp = "70";
std::string CamDown = "71";
std::string CamLeft = "72";
std::string CamRight = "73";
std::string Heal = "76";
std::string Taunt = "59"; // Y
std::string WeaponMenu = "77";
std::string WeaponMenu2 = "78";
std::string Run = "55"; // U
std::string BladeMode = "4C"; // L
std::string Subweapon = "79";
std::string Lockon = "80";
std::string Pause = "81";
std::string Pause2 = "75";
std::string Ability = "82";
std::string CamReset = "83";

std::string GamepadForward = "XINPUT_GAMEPAD_LEFT_THUMB_UP";
std::string GamepadBack = "XINPUT_GAMEPAD_LEFT_THUMB_DOWN";
std::string GamepadLeft = "XINPUT_GAMEPAD_LEFT_THUMB_LEFT";
std::string GamepadRight = "XINPUT_GAMEPAD_LEFT_THUMB_RIGHT";
std::string GamepadNormalAttack = "XINPUT_GAMEPAD_X";
std::string GamepadStrongAttack = "XINPUT_GAMEPAD_Y";
std::string GamepadJump = "XINPUT_GAMEPAD_A";
std::string GamepadInteract = "XINPUT_GAMEPAD_B";
std::string GamepadCamUp = "XINPUT_GAMEPAD_RIGHT_THUMB_UP";
std::string GamepadCamDown = "XINPUT_GAMEPAD_RIGHT_THUMB_DOWN";
std::string GamepadCamLeft = "XINPUT_GAMEPAD_RIGHT_THUMB_LEFT";
std::string GamepadCamRight = "XINPUT_GAMEPAD_RIGHT_THUMB_RIGHT";
std::string GamepadHeal = "XINPUT_GAMEPAD_DPAD_DOWN";
std::string GamepadTaunt = "XINPUT_GAMEPAD_DPAD_UP";
std::string GamepadWeaponMenu = "XINPUT_GAMEPAD_DPAD_LEFT";
std::string GamepadWeaponMenu2 = "XINPUT_GAMEPAD_DPAD_RIGHT";
std::string GamepadRun = "XINPUT_GAMEPAD_RIGHT_TRIGGER";
std::string GamepadBladeMode = "XINPUT_GAMEPAD_LEFT_TRIGGER";
std::string GamepadSubweapon = "XINPUT_GAMEPAD_LEFT_SHOULDER";
std::string GamepadLockon = "XINPUT_GAMEPAD_RIGHT_SHOULDER";
std::string GamepadPause = "XINPUT_GAMEPAD_START";
std::string GamepadPause2 = "XINPUT_GAMEPAD_BACK";
std::string GamepadAbility = "XINPUT_GAMEPAD_LEFT_THUMB";
std::string GamepadCamReset = "XINPUT_GAMEPAD_RIGHT_THUMB";

std::string GamepadSpawnSam = "XINPUT_GAMEPAD_START";
std::string GamepadSpawnWolf = "XINPUT_GAMEPAD_BACK";
std::string GamepadSpawnArmstrong = "XINPUT_GAMEPAD_LEFT_TRIGGER";
std::string GamepadSpawnBossSam = "XINPUT_GAMEPAD_RIGHT_TRIGGER";

bool DisableNumberBinds = false;



DWORD dwResult;
XINPUT_STATE state;

//this struct begins from player CF8 field (player key isHolding), size - 0x30;
struct KeysStruct
{
	unsigned int keyCode; //CF8
	unsigned int  field_4;//CFC
	unsigned int  field_8;//D00
	unsigned int  field_C;//D04
	float moveFloatA;//D08
	float moveFloatB;//D0C
	float bladeMoveFloatA;//D10
	float bladeMoveFloatB;//D14
	unsigned int field_20;//D18
	unsigned int field_24;//D1C
	unsigned int field_28;//D20
	unsigned int field_2C;//D24
};

KeysStruct* m_pKeysStruct;
KeysStruct m_nKeysStruct;


struct ModelItems
{
	unsigned int m_nModel;
	unsigned int m_nHair;
	unsigned int m_nVisor;
	unsigned int m_nSheath;
	unsigned int m_nHead;
};




ModelItems* modelItems;
ModelItems originalModelItems;


//original address in game is "METAL GEAR RISING REVENGEANCE.exe"+1777E60
struct Player1_Keys
{
	unsigned int key_forward = 'W';
	unsigned int key_back = 'S';
	unsigned int key_left = 'A';
	unsigned int key_right = 'D';
	unsigned int key_slowWalking = VK_TAB;
	unsigned int key_jump = VK_SPACE;
	unsigned int key_normalAttack = 0x80000001;
	unsigned int key_strongAttack = 0x80000002;
	unsigned int key_bladeMode = 0x9F;
	unsigned int key_run = 0x9B;
	unsigned int key_action = 'F';
	unsigned int key_ripperMode = 'R';
	unsigned int key_target = 'E';
	unsigned int key_useSecondaryWeapon = 'V';
	unsigned int key_useItem = 'Q';
	unsigned int key_visor = '1';
	unsigned int key_weaponSelect = '2';
